Tekla.Structures.ModelInternal.ModelModuleManager
Internal Module Manager to check configuration against Insert/Modify commands.

Tekla.Structures.ModelInternal.ModelModuleManager.CheckModules(Tekla.Structures.Model.ModelObject.ModelObjectEnum)
Checks current module configuration against Insert/Modify command.
Type: Type of the object to check for creation
Throws System.MethodAccessException: Cast an exception if operation is not allowed.